const u8 gTeachyTvString_TeachBattle[] = _("למד אותי איך להילחם.");
const u8 gTeachyTvString_StatusProblems[] = _("מה הן בעיות סטטוס?");
const u8 gTeachyTvString_TypeMatchups[] = _("מה הן התאמות סוג?");
const u8 gTeachyTvString_CatchPkmn[] = _("אני רוצה לתפוס פוקימונים.");
const u8 gTeachyTvString_AboutTMs[] = _("למד אותי על מכונות טכניות.");
const u8 gTeachyTvString_RegisterItem[] = _("איך אני רושם פריט?");
const u8 gTeachyTvString_Cancel[] = _("ביטול");

const u8 gTeachyTvText_PokedudeSaysHello[] = _(
    "היי, לכל המאמנים שם בחוץ!\n"
    "שלום, מאמנים!\p"
    "……… ……… ………\p"
    "בואו, תנו לי לשמוע אתכם!\n"
    "שלום, מאמנים!\l"
    "זה אני, הפוקי דוד!\p");

const u8 gTeachyTvText_BattleScript1[] = _(
    "היום, הפוקי דוד כאן כדי\n"
    "לספר לכם איך אתם יכולים להילחם\l"
    "בפוקימונים!\p"
    "נניח שאתם יוצאים לטיול ופתאום,\n"
    "פוקימון פראי מופיע!\p"
    "זה תלוי בכם להשתמש בחוכמה\n"
    "בפוקימונים שלכם ובמהלכים שלהם כדי\l"
    "להוריד את נקודות החיים של היריב לאפס,\l"
    "ולזכות בניצחון!\p"
    "אני אראה לכם איך לעשות את זה\n"
    "באופן אישי ובטוח!\p"
    "טוב, בואו נתחיל!\p"
    "שמרו את העיניים שלכם דבוקות למופע\n"
    "הסופר פוקי דוד!");

const u8 gTeachyTvText_BattleScript2[] = _(
    "נו, הבנתם את זה?\p"
    "גם אם נקודות החיים של הפוקימון שלכם\n"
    "יורדות לאפס, והוא נהיה\l"
    "בלתי כשיר לקרב, אל דאגה!\p"
    "פשוט קחו אותו לכל מרכז\n"
    "פוקימונים ורפאו אותו!\p"
    "טוב, נתראה!\p"
    "זכרו, מאמנים, מעשה טוב\n"
    "ביום מביא אושר שיישאר!");

const u8 gTeachyTvText_StatusScript1[] = _(
    "היום, הפוקי דוד כאן כדי\n"
    "לספר לכם על בעיות סטטוס!\p"
    "בעיות סטטוס כוללות הרעלה,\n"
    "שיתוק, שינה, כוויה...\p"
    "יש עוד כמה אחרות, אבל\n"
    "הן באמת צרות צרורות.\p"
    "תקבלו אחת מהן, והפוקימון שלכם\n"
    "עלול להיות חסר תועלת בקרב.\p"
    "אתם יודעים, זה כואב לפוקי דוד\n"
    "לראות פוקימון סובל...\p"
    "אז, מה צריך לעשות אם הפוקימון\n"
    "שלכם מקבל בעיית סטטוס?\p"
    "ובכן, יש לכם אותי להראות לכם!\p"
    "טוב, בואו נתחיל!\p"
    "שמרו את העיניים שלכם דבוקות למופע\n"
    "הסופר פוקי דוד!");

const u8 gTeachyTvText_StatusScript2[] = _(
    "הרעלה או שיתוק לא נעלמים\n"
    "אחרי קרב.\p"
    "אם פוקימון מורעל, הוא מאבד\n"
    "נקודות חיים גם בזמן שאתם הולכים.\p"
    "כדאי לרפא פוקימונים מבעיות\n"
    "כאלה מיד.\p"
    "השתמשו בפריט, או נסו להגיע למרכז\n"
    "פוקימונים לריפוי.\p"
    "זה לא היה קשה, נכון?\n"
    "טוב, נתראה!\p"
    "זכרו, מאמנים, מעשה טוב\n"
    "ביום מביא אושר שיישאר!");

const u8 gTeachyTvText_MatchupsScript1[] = _(
    "האם כולם יודעים על התאמות\n"
    "סוגים?\p"
    "פוקימונים והמהלכים שלהם כולם\n"
    "שייכים לסוגים מסוימים.\p"
    "למשל, יש סוגים כמו\n"
    "דשא ומים.\p"
    "אתם צריכים לשקול את הסוג של\n"
    "המהלך שמשתמשים בו להתקפה...\p"
    "וגם את הסוג של הפוקימון\n"
    "שסופג את ההתקפה הזו.\p"
    "בהתאם לאיך ששני הסוגים האלה\n"
    "מתאימים, הנזק יכול להשתנות.\p"
    "אתם רואים, זה תלוי אם\n"
    "ההתאמה טובה או רעה.\p"
    "אם אתם לא יודעים איך התאמות\n"
    "עובדות, קרבות יהיו קשים.\p"
    "אז, תנו לי להדגים בדיוק\n"
    "למה אני מתכוון.\p"
    "טוב, בואו נתחיל!\p"
    "שמרו את העיניים שלכם דבוקות למופע\n"
    "הסופר פוקי דוד!");

const u8 gTeachyTvText_MatchupsScript2[] = _(
    "האם אפשר לבצע התקפה\n"
    "שתגרום לנזק כבד?\p"
    "האם הפוקימון היריב מהווה\n"
    "איום לפוקימון שלכם?\p"
    "האם יש סיכוי שיש לו\n"
    "מהלכים הרסניים קשים?\p"
    "עקבו אחר התאמות הסוגים כדי להשיג\n"
    "יתרון!\p"
    "טוב, נתראה!\p"
    "אה, עבור הפוקי דוד מסוג מגניב,\n"
    "ילדים מדהימים כמוכם מתאימים\l"
    "בצורה מושלמת!\p"
    "זכרו, מעשה טוב\n"
    "ביום מביא אושר שיישאר!");

const u8 gTeachyTvText_CatchingScript1[] = _(
    "היום, הפוקי דוד הולך\n"
    "להראות לכם איך לתפוס פוקימונים!\p"
    "רק תדמיינו... פוקימון מגניב\n"
    "פתאום מופיע בטבע!\p"
    "אה, אתם רוצים אותו!\n"
    "אתם פשוט לא יכולים להתאפק!\p"
    "אה, אתם חייבים לתפוס אותו!\n"
    "אתם חייבים שיהיה לכם אותו!\p"
    "תנו לי להראות לכם איך אתם יכולים\n"
    "לגרום לזה לקרות!\p"
    "טוב, בואו נתחיל!\p"
    "שמרו את העיניים שלכם דבוקות למופע\n"
    "הסופר פוקי דוד!");

const u8 gTeachyTvText_CatchingScript2[] = _(
    "אם כדור הפוקי הראשון שלכם נכשל\n"
    "בלתפוס את הפוקימון, אל תוותרו!\p"
    "המשיכו לזרוק כדורי פוקי...\n"
    "זה חייב לעבוד מתישהו!\p"
    "טוב, נתראה!\p"
    "זכרו, מאמנים, מעשה טוב\n"
    "ביום מביא אושר שיישאר!");

const u8 gTeachyTvText_TMsScript1[] = _(
    "היי, כולם!\n"
    "יש לכם כולם מכונות טכניות?\p"
    "מהלך מאמן, או מ”מ, היא\n"
    "פריט מדהים ונהדר!\p"
    "היא מלמדת פוקימונים מהלך\n"
    "שהם אולי לא ילמדו כשהם עולים רמה!\p"
    "זה לא פשוט נהדר? איזה\n"
    "עולם נוח אנחנו חיים בו!\p"
    "פתחו את תיק המכונות הטכניות ובדקו\n"
    "את המכונות הטכניות שיש לכם.\p"
    "אתם יכולים לבדוק אותן בפירוט,\n"
    "גם.");

const u8 gPokedudeText_TMTypes[] = _(
    "פוקי דוד: נורמלי, מים, דשא...\n"
    "מכונות טכניות באות גם בסוגים.\p"
    "בדקו את הסוג ולמדו אותו\n"
    "לפוקימון שמתאים טוב.\p"
    "למשל, גל מים מתאים\n"
    "לפוקימונים מסוג מים.\p"
    "זרע כדור הוא מהלך שרוב\n"
    "הפוקימונים מסוג דשא יכולים ללמוד.\p"
    "יש עוד דבר אחד!");

const u8 gPokedudeText_ReadTMDescription[] = _(
    "אל תסתכלו רק על הסוג, תקראו\n"
    "גם את התיאור.\p"
    "הוא יכיל רמזים לגבי איזה\n"
    "פוקימונים יכולים ללמוד את המהלך.\p"
    "למשל, קחו מהלך כמו\n"
    "אגרוף מיקוד.\p"
    "זה לא נשמע כמו משהו שפוקימון\n"
    "ציפור או דג יכול ללמוד.\p"
    "אז, נסו להשתמש בו על פוקימונים עם\n"
    "זרועות שיכולות לתת אגרופים!");

const u8 gTeachyTvText_TMsScript2[] = _(
    "וואו, דיברתי המון היום!\n"
    "טוב, נתראה!\p"
    "זכרו, מאמנים, מעשה טוב\n"
    "ביום מביא אושר שיישאר!");

const u8 gTeachyTvText_RegisterScript1[] = _(
    "התיק של המאמן יש בו המון\n"
    "תכונות מגניבות ונוחות!\p"
    "קחו למשל דברים בכיס\n"
    "הפריטים החשובים.\p"
    "אתם יכולים להשתמש בפריט חשוב בלי\n"
    "לפתוח את התיק בכל פעם.\p"
    "למשל, בואו נעמיד פנים שיש לי\n"
    "טלוויזיה מלמדת בתיק שלי.\p"
    "אני יכול לרשום אותה לשימוש מיידי,\n"
    "ואני אראה לכם איך!\p"
    "טוב, בואו נתחיל!\p"
    "שמרו את העיניים שלכם דבוקות למופע\n"
    "הסופר פוקי דוד, פחות או יותר!");

const u8 gTeachyTvText_RegisterScript2[] = _(
    "ועכשיו, הטלוויזיה המלמדת שלכם\n"
    "רשומה.\p"
    "איך משתמשים בה?\n"
    "ובכן, ככה זה עובד.\p"
    "ברגע שפריט בכיס הפריטים\n"
    "החשובים רשום, אתם יכולים להשתמש\l"
    "בו על ידי לחיצה על SELECT.\p"
    "אז, נתתם לעצמכם\n"
    "גישה בלחיצה אחת לטלוויזיה המלמדת.\p"
    "כל מה שצריך כדי לראות אותי זה\n"
    "ללחוץ על כפתור אחד!\p"
    "כזאת תשומת לב קצת\n"
    "מביכה!\p"
    "טוב, נתראה!\p"
    "זכרו, מאמנים, מעשה טוב\n"
    "ביום מביא אושר שיישאר!");