const u8 gTeachyTvString_TeachBattle[] = _("תלמד אותי איך להילחם.");
const u8 gTeachyTvString_StatusProblems[] = _("מהן בעיות מצב?");
const u8 gTeachyTvString_TypeMatchups[] = _("מהן התאמות סוג?");
const u8 gTeachyTvString_CatchPkmn[] = _("אני רוצה לתפוס פוקימונים.");
const u8 gTeachyTvString_AboutTMs[] = _("תלמד אותי על מ”נ.");
const u8 gTeachyTvString_RegisterItem[] = _("איך אני רושם פריט?");
const u8 gTeachyTvString_Cancel[] = _("ביטול");

const u8 gTeachyTvText_PokedudeSaysHello[] = _(
    "היי, כל המאמנים שם בחוץ!\n"
    "שלום, מאמנים!\p"
    "……… ……… ………\p"
    "בואו, תנו לי לשמוע אתכם!\n"
    "שלום, מאמנים!\l"
    "זה אני, איש הפוקימון!\p");

const u8 gTeachyTvText_BattleScript1[] = _(
    "היום, איש הפוקימון כאן כדי לספר לכם\n"
    "איך להילחם עם פוקימונים!\p"
    "נגיד שאתה יוצא לטיול כשפתאום,\n"
    "פוקימון פראי מופיע!\p"
    "זה תלוי בך להשתמש בפוקימונים\n"
    "שלך ובתנועות שלהם כדי להפחית\n"
    "את נקודות הבריאות של היריב לאפס\n"
    "ולזכות בניצחון!\p"
    "אני אראה לך איך לעשות את זה\n"
    "באופן אישי ובטוח!\p"
    "יאללה, הנה זה בא!\p"
    "תשאירו עיניים נעולות על מופע\n"
    "האיש הפוקימון הסופר!");

const u8 gTeachyTvText_BattleScript2[] = _(
    "טוב, קלטת את זה?\p"
    "גם אם נקודות הבריאות של הפוקימון\n"
    "שלך יורדות לאפס והוא לא מסוגל\n"
    "להילחם, אל תדאג!\p"
    "פשוט קח אותו לכל מרכז פוקימון\n"
    "ורפא אותו!\p"
    "בסדר, נתראה!\p"
    "זכרו, מאמנים, מעשה טוב ביום\n"
    "מביא שמחה שנשארת!");

const u8 gTeachyTvText_StatusScript1[] = _(
    "היום, איש הפוקימון כאן כדי לספר לכם\n"
    "על בעיות מצב!\p"
    "בעיות מצב כוללות הרעלה, שיתוק,\n"
    "שינה, כוויות…\p"
    "יש עוד כמה, אבל הן באמת בעיות.\p"
    "תקבל אחת, והפוקימון שלך יכול\n"
    "להיות חסר תועלת בקרב.\p"
    "אתם יודעים, זה כואב לאיש הפוקימון\n"
    "לראות פוקימון סובל…\p"
    "אז, מה כדאי לעשות אם הפוקימון\n"
    "שלך מקבל בעיית מצב?\p"
    "ובכן, יש לך אותי כדי להראות לך!\p"
    "יאללה, הנה זה בא!\p"
    "תשאירו עיניים נעולות על מופע\n"
    "האיש הפוקימון הסופר!");

const u8 gTeachyTvText_StatusScript2[] = _(
    "הרעלה או שיתוק לא נעלמים אחרי\n"
    "קרב.\p"
    "אם פוקימון מורעל, הוא מאבד\n"
    "נקודות בריאות גם בזמן ההליכה.\p"
    "כדאי לרפא את הפוקימונים שלך\n"
    "מבעיות כאלה מיד.\p"
    "השתמש בפריט או נסה להגיע\n"
    "למרכז פוקימון לריפוי.\p"
    "זה לא היה קשה, נכון?\n"
    "בסדר, נתראה!\p"
    "זכרו, מאמנים, מעשה טוב ביום\n"
    "מביא שמחה שנשארת!");

const u8 gTeachyTvText_MatchupsScript1[] = _(
    "האם כולם מכירים התאמות סוג?\p"
    "הפוקימונים והתנועות שלהם שייכים\n"
    "לסוגים מסוימים.\p"
    "לדוגמה, יש סוגים כמו דשא ומים.\p"
    "צריך לשקול את סוג התנועה\n"
    "שמשמשת לתקיפה…\p"
    "ואת סוג הפוקימון שמקבל את\n"
    "התקיפה.\p"
    "בהתאם לאיך שהסוגים האלה תואמים,\n"
    "הנזק יכול להשתנות.\p"
    "אתם מבינים, זה תלוי אם ההתאמה\n"
    "היא טובה או רעה.\p"
    "אם לא תבינו איך ההתאמות עובדות,\n"
    "הקרבות יהיו קשים.\p"
    "אז, תנו לי להדגים בדיוק למה\n"
    "אני מתכוון.\p"
    "יאללה, הנה זה בא!\p"
    "תשאירו עיניים נעולות על מופע\n"
    "האיש הפוקימון הסופר!");

const u8 gTeachyTvText_MatchupsScript2[] = _(
    "האם אפשר לשגר התקפה שתגרום\n"
    "לנזק כבד?\p"
    "האם הפוקימון היריב מהווה איום\n"
    "לפוקימון שלך?\p"
    "האם יש סיכוי שהוא יכול להיות\n"
    "עם תנועות מסוכנות ביותר?\p"
    "תצפו בהתאמות הסוג כדי לקבל\n"
    "יד על העליונה!\p"
    "בסדר, נתראה!\p"
    "אה, לאיש הפוקימון מגניב כמוני,\n"
    "ילדים מדהימים כמוכם תואמים\n"
    "מושלם!\p"
    "זכרו, מעשה טוב ביום\n"
    "מביא שמחה שנשארת!");

const u8 gTeachyTvText_CatchingScript1[] = _(
    "היום, איש הפוקימון ילמד אתכם איך\n"
    "לתפוס פוקימונים!\p"
    "פשוט תדמיינו… פוקימון מגניב\n"
    "שפתאום מופיע בטבע!\p"
    "אה, אתה רוצה אותו!\n"
    "פשוט אי אפשר לעמוד בפיתוי!\p"
    "אה, אתה חייב לתפוס אותו!\n"
    "אתה חייב שיהיה לך אותו!\p"
    "תן לי להראות לך איך זה קורה!\p"
    "יאללה, הנה זה בא!\p"
    "תשאירו עיניים נעולות על מופע\n"
    "האיש הפוקימון הסופר!");

const u8 gTeachyTvText_CatchingScript2[] = _(
    "אם הפוקבול הראשון שלך לא תופס\n"
    "את הפוקימון, אל תוותר!\p"
    "תמשיך לזרוק פוקבולים…");